ZeHHHHH/SWM330_Lib/SWM330_StdPeriph_Driver/CSL/SWM330_StdPeriph_Driver/SWM330_qspi.c
/*******************************************************************************************************************************
* @brief	QSPI driver
*
*
********************************************************************************************************************************
* @attention
*
* THE PRESENT FIRMWARE WHICH IS FOR GUIDANCE ONLY AIMS AT PROVIDING CUSTOMERS WITH CODING INFORMATION 
* REGARDING THEIR PRODUCTS IN ORDER FOR THEM TO SAVE TIME. AS A RESULT, SYNWIT SHALL NOT BE HELD LIABLE 
* FOR ANY DIRECT, INDIRECT OR CONSEQUENTIAL DAMAGES WITH RESPECT TO ANY CLAIMS ARISING FROM THE CONTENT 
* OF SUCH FIRMWARE AND/OR THE USE MADE BY CUSTOMERS OF THE CODING INFORMATION CONTAINED HEREIN IN CONN-
* -ECTION WITH THEIR PRODUCTS.
*
* COPYRIGHT 2012 Synwit Technology 
*******************************************************************************************************************************/
#include "SWM330.h"
#include "SWM330_qspi.h"


static uint8_t AddressSize;


/*******************************************************************************************************************************
* @brief	QSPI init
* @param	QSPIx is the QSPI to init
* @param	initStruct is data used to init the QSPI
* @return
*******************************************************************************************************************************/
void QSPI_Init(QSPI_TypeDef * QSPIx, QSPI_InitStructure * initStruct)
{
	switch((uint32_t)QSPIx)
	{
	case ((uint32_t)QSPI0):
		SYS->CLKEN0 |= (0x01 << SYS_CLKEN0_QSPI0_Pos);
		break;
	
	case ((uint32_t)QSPI1):
		SYS->CLKEN0 |= (0x01 << SYS_CLKEN0_QSPI1_Pos);
		break;
	}
	
	QSPI_Close(QSPIx);
	
	QSPIx->CR = (1						<< QSPI_CR_TOEN_Pos)   |
				(0						<< QSPI_CR_SSHIFT_Pos) |
				(8						<< QSPI_CR_FFTHR_Pos)  |
				(initStruct->IntEn		<< QSPI_CR_ERRIE_Pos)  |
				((initStruct->ClkDiv-1)	<< QSPI_CR_CLKDIV_Pos);
	
	QSPIx->DCR = (initStruct->ClkMode 	<< QSPI_DCR_CLKMOD_Pos) |
				 (3						<< QSPI_DCR_CSHIGH_Pos) |
				 (initStruct->Size		<< QSPI_DCR_FLSIZE_Pos);
	
	AddressSize = initStruct->Size / 8;
	
	QSPIx->SSHIFT = initStruct->SampleShift & 0x0F;
	
	QSPIx->CS0TO = 100;
	
	QSPIx->FCR = 0x1B;
	if(initStruct->IntEn)
	{
		switch((uint32_t)QSPIx)
		{
		case ((uint32_t)QSPI0):	NVIC_EnableIRQ(QSPI0_IRQn); break;
		case ((uint32_t)QSPI1):	NVIC_EnableIRQ(QSPI1_IRQn); break;
		}
	}
}


/*******************************************************************************************************************************
* @brief	QSPI open
* @param	QSPIx is the QSPI to open
* @return
*******************************************************************************************************************************/
void QSPI_Open(QSPI_TypeDef * QSPIx)
{
	QSPIx->CR |= QSPI_CR_EN_Msk;
}


/*******************************************************************************************************************************
* @brief	QSPI close
* @param	QSPIx is the QSPI to close
* @param	initStruct is data used to init the QSPI
* @return
*******************************************************************************************************************************/
void QSPI_Close(QSPI_TypeDef * QSPIx)
{
	QSPIx->CR &= ~QSPI_CR_EN_Msk;
}


/*******************************************************************************************************************************
* @brief	QSPI_CmdStructure instance clear
* @param	cmdStruct is the QSPI_CmdStructure instance to clear
* @return
*******************************************************************************************************************************/
void QSPI_CmdStructClear(QSPI_CmdStructure * cmdStruct)
{
	cmdStruct->Instruction		  = 0;
	cmdStruct->InstructionMode	  = 0;
	cmdStruct->Address 			  = 0;
	cmdStruct->AddressMode		  = 0;
	cmdStruct->AddressSize		  = 0;
	cmdStruct->AlternateBytes 	  = 0;
	cmdStruct->AlternateBytesMode = 0;
	cmdStruct->AlternateBytesSize = 0;
	cmdStruct->DummyCycles		  = 0;
	cmdStruct->DataMode			  = 0;
	cmdStruct->DataCount		  = 0;
	cmdStruct->SendInstOnlyOnce   = 0;
}


/*******************************************************************************************************************************
* @brief	QSPI send command
* @param	QSPIx is the QSPI to use
* @param	cmdMode: QSPI_Mode_IndirectWrite, QSPI_Mode_IndirectRead, QSPI_Mode_AutoPolling, or QSPI_Mode_MemoryMapped
* @param	cmdStruct contains the command to be sent out
* @return
*******************************************************************************************************************************/
void QSPI_Command(QSPI_TypeDef * QSPIx, uint8_t cmdMode, QSPI_CmdStructure * cmdStruct)
{
	if(cmdStruct->AlternateBytesMode != QSPI_PhaseMode_None)
		QSPIx->ABR = cmdStruct->AlternateBytes;
	
	if(cmdStruct->DataMode != QSPI_PhaseMode_None)
		QSPIx->DLR = cmdStruct->DataCount - 1;
	
	QSPIx->CCR = (cmdStruct->Instruction		<< QSPI_CCR_CODE_Pos)   |
				 (cmdStruct->InstructionMode	<< QSPI_CCR_IMODE_Pos)  |
				 (cmdStruct->AddressMode		<< QSPI_CCR_AMODE_Pos)  |
				 (cmdStruct->AddressSize		<< QSPI_CCR_ASIZE_Pos)  |
				 (cmdStruct->AlternateBytesMode	<< QSPI_CCR_ABMODE_Pos) |
				 (cmdStruct->AlternateBytesSize	<< QSPI_CCR_ABSIZE_Pos) |
				 (cmdStruct->DummyCycles		<< QSPI_CCR_DUMMY_Pos)  |
				 (cmdStruct->DataMode			<< QSPI_CCR_DMODE_Pos)  |
				 (cmdMode						<< QSPI_CCR_MODE_Pos)   |
				 (cmdStruct->SendInstOnlyOnce	<< QSPI_CCR_SIOO_Pos);
	
	if(cmdStruct->AddressMode != QSPI_PhaseMode_None)
		QSPIx->AR = cmdStruct->Address;
	
	for(int i = 0; i < 3; i++) __NOP();
}


/*******************************************************************************************************************************
* @brief	SPI Flash erase
* @param	QSPIx is the QSPI to use
* @param	addr is the SPI Flash address to erase
* @param	block_size is block size (in kbytes) to erase, support 4 and 64
* @param	wait: 1 wait for erase operation done, 0 send out erase command, and then immediately return.
* @return
*******************************************************************************************************************************/
void QSPI_Erase_(QSPI_TypeDef * QSPIx, uint32_t addr, uint16_t block_size, uint8_t wait)
{
	QSPI_CmdStructure cmdStruct;
	QSPI_CmdStructClear(&cmdStruct);
	
