ZeHHHHH/SWM330_Lib/SWM330_StdPeriph_Driver/CSL/SWM330_StdPeriph_Driver/SWM330_qspi.c
	uint32_t n_word = count / 4;
	
	for(int i = 0; i < n_word; i++)
	{
		uint32_t * p_word = (uint32_t *)buff;
		
		while(QSPI_FIFOCount(QSPIx) < 4) __NOP();
		
		p_word[i] = QSPIx->DRW;
	}
	
	if((count % 4) / 2)
	{
		uint16_t * p_half = (uint16_t *)&buff[n_word * 4];
		
		while(QSPI_FIFOCount(QSPIx) < 2) __NOP();
		
		p_half[0] = QSPIx->DRH;
	}
	
	if(count % 2)
	{
		while(QSPI_FIFOCount(QSPIx) < 1) __NOP();
		
		buff[count - 1] = QSPIx->DRB;
	}
}


/*******************************************************************************************************************************
* @brief	SPI Flash memory map, then you can access SPI Flash content by directly reading address [0x70000000, 0x78000000)
* @param	QSPIx is the QSPI to use
* @param	addr_width is number of data line to use in address phase, can be 1, 2 or 4
* @param	data_width is number of data line to use in data phase, can be 1, 2 or 4
* @return
*******************************************************************************************************************************/
void QSPI_MemoryMap(QSPI_TypeDef * QSPIx, uint8_t addr_width, uint8_t data_width)
{
	while(QSPI_Busy(QSPIx)) __NOP();
	
	QSPIx->CACHE |= QSPI_CACHE_CLR_Msk;
	for(int i = 0; i < CyclesPerUs; i++) __NOP();
	
	uint8_t instruction, addressMode, dataMode, dummyCycles;
	uint8_t alternateBytesMode, alternateBytesSize, alternateBytes;
	switch((addr_width << 4) | data_width)
	{
	case 0x11:
		instruction 	   = (AddressSize == QSPI_PhaseSize_32bit) ? QSPI_C4B_FAST_READ        : QSPI_CMD_FAST_READ;
		addressMode 	   = QSPI_PhaseMode_1bit;
		alternateBytesMode = QSPI_PhaseMode_None;
		alternateBytesSize = 0;
		dummyCycles        = 8;
		dataMode 		   = QSPI_PhaseMode_1bit;
		break;
	
	case 0x12:
		instruction 	   = (AddressSize == QSPI_PhaseSize_32bit) ? QSPI_C4B_FAST_READ_2bit   : QSPI_CMD_FAST_READ_2bit;
		addressMode 	   = QSPI_PhaseMode_1bit;
		alternateBytesMode = QSPI_PhaseMode_None;
		alternateBytesSize = 0;
		dummyCycles        = 8;
		dataMode 		   = QSPI_PhaseMode_2bit;
		break;
	
	case 0x22:
		instruction 	   = (AddressSize == QSPI_PhaseSize_32bit) ? QSPI_C4B_FAST_READ_IO2bit : QSPI_CMD_FAST_READ_IO2bit;
		addressMode 	   = QSPI_PhaseMode_2bit;
		alternateBytesMode = QSPI_PhaseMode_2bit;
		alternateBytesSize = QSPI_PhaseSize_8bit;
		alternateBytes     = 0xFF;
		dummyCycles        = 0;
		dataMode 		   = QSPI_PhaseMode_2bit;
		break;
	
	case 0x14:
		instruction 	   = (AddressSize == QSPI_PhaseSize_32bit) ? QSPI_C4B_FAST_READ_4bit   : QSPI_CMD_FAST_READ_4bit;
		addressMode 	   = QSPI_PhaseMode_1bit;
		alternateBytesMode = QSPI_PhaseMode_None;
		alternateBytesSize = 0;
		dummyCycles        = 8;
		dataMode 		   = QSPI_PhaseMode_4bit;
		break;
	
	case 0x44:
		instruction 	   = (AddressSize == QSPI_PhaseSize_32bit) ? QSPI_C4B_FAST_READ_IO4bit : QSPI_CMD_FAST_READ_IO4bit;
		addressMode 	   = QSPI_PhaseMode_4bit;
		alternateBytesMode = QSPI_PhaseMode_4bit;
		alternateBytesSize = QSPI_PhaseSize_8bit;
		alternateBytes     = 0xFF;
		dummyCycles        = 4;
		dataMode 		   = QSPI_PhaseMode_4bit;
		break;
	}
	
	if(alternateBytesMode != QSPI_PhaseMode_None)
		QSPIx->ABR = alternateBytes;
		
	QSPIx->CCR = (instruction				<< QSPI_CCR_CODE_Pos)   |
				 (QSPI_PhaseMode_1bit		<< QSPI_CCR_IMODE_Pos)  |
				 (addressMode				<< QSPI_CCR_AMODE_Pos)  |
				 (AddressSize				<< QSPI_CCR_ASIZE_Pos)  |
				 (alternateBytesMode		<< QSPI_CCR_ABMODE_Pos) |
				 (alternateBytesSize		<< QSPI_CCR_ABSIZE_Pos) |
				 (dummyCycles				<< QSPI_CCR_DUMMY_Pos)  |
				 (dataMode					<< QSPI_CCR_DMODE_Pos)  |
				 (QSPI_Mode_MemoryMapped	<< QSPI_CCR_MODE_Pos)   |
				 (0							<< QSPI_CCR_SIOO_Pos);
}


/*******************************************************************************************************************************
* @brief	SPI Flash memory map close
* @param	QSPIx is the QSPI to use
* @return
*******************************************************************************************************************************/
void QSPI_MemoryMapClose(QSPI_TypeDef * QSPIx)
{
	while(QSPI_Busy(QSPIx)) __NOP();
	
	QSPI_FlashBusy(QSPIx);
}


/*******************************************************************************************************************************
* @brief	SPI Flash busy query
* @param	QSPIx is the QSPI to query
* @return	1 SPI Flash is busy for internal erase or write, 0 SPI Flash internal operation done
*******************************************************************************************************************************/
bool QSPI_FlashBusy(QSPI_TypeDef * QSPIx)
{
	uint16_t reg = QSPI_ReadReg(QSPIx, QSPI_CMD_READ_STATUS_REG1, 1);
	
	return reg & (1 << QSPI_STATUS_REG1_BUSY_Pos);
}


/*******************************************************************************************************************************
* @brief	SPI Flash quad state query
* @param	QSPIx is the QSPI to query
* @return	QE bit value
*******************************************************************************************************************************/
uint8_t QSPI_QuadState(QSPI_TypeDef * QSPIx)
{
	uint8_t reg = QSPI_ReadReg(QSPIx, QSPI_CMD_READ_STATUS_REG2, 1);
	
	return (reg & (1 << QSPI_STATUS_REG2_QUAD_Pos)) ? 1 : 0;
}


/*******************************************************************************************************************************
* @brief	SPI Flash quad mode switch
* @param	QSPIx is the QSPI to use
* @param	on/off
* @return
*******************************************************************************************************************************/
void QSPI_QuadSwitch(QSPI_TypeDef * QSPIx, uint8_t on)
{
	uint8_t reg = QSPI_ReadReg(QSPIx, QSPI_CMD_READ_STATUS_REG2, 1);
	
	if(on)
		reg |=  (1 << QSPI_STATUS_REG2_QUAD_Pos);
	else
		reg &= ~(1 << QSPI_STATUS_REG2_QUAD_Pos);
	
	QSPI_WriteEnable(QSPIx);
	
	QSPI_WriteReg(QSPIx, QSPI_CMD_WRITE_STATUS_REG2, reg, 1);
	
	while(QSPI_FlashBusy(QSPIx)) __NOP();
}


/*******************************************************************************************************************************
* @brief	SPI Flash register read
* @param	QSPIx is the QSPI to use
* @param	cmd is the command used to read SPI Flash register
* @param	n_bytes is the number of byte to read, can be 1, 2, 3, or 4
* @return	the data read from SPI Flash, MSB
*******************************************************************************************************************************/
uint32_t QSPI_ReadReg(QSPI_TypeDef * QSPIx, uint8_t cmd, uint8_t n_bytes)
{
	QSPI_CmdStructure cmdStruct;
	QSPI_CmdStructClear(&cmdStruct);
	
	cmdStruct.InstructionMode 	 = QSPI_PhaseMode_1bit;
	cmdStruct.Instruction 		 = cmd;
	cmdStruct.AddressMode 		 = QSPI_PhaseMode_None;
	cmdStruct.AlternateBytesMode = QSPI_PhaseMode_None;
	cmdStruct.DummyCycles 		 = 0;
	cmdStruct.DataMode 			 = QSPI_PhaseMode_1bit;
	cmdStruct.DataCount 		 = n_bytes;
	
	QSPI_Command(QSPIx, QSPI_Mode_IndirectRead, &cmdStruct);
	
	while(QSPI_FIFOCount(QSPIx) < n_bytes) __NOP();
	
