ZeHHHHH/SWM330_Lib/SWM330_StdPeriph_Driver/CSL/SWM330_StdPeriph_Driver/SWM330_qspi.c
	uint32_t data = 0;
	for(int i = n_bytes; i > 0; i--)
		((uint8_t *)&data)[i-1] = QSPIx->DRB;
	
	return data;
}


void QSPI_ReadRegEx(QSPI_TypeDef * QSPIx, uint8_t cmd, uint8_t n_dummy, uint8_t *buffer, uint8_t n_bytes)
{
	QSPI_CmdStructure cmdStruct;
	QSPI_CmdStructClear(&cmdStruct);
	
	cmdStruct.InstructionMode 	 = QSPI_PhaseMode_1bit;
	cmdStruct.Instruction 		 = cmd;
	cmdStruct.AddressMode 		 = QSPI_PhaseMode_None;
	cmdStruct.AlternateBytesMode = QSPI_PhaseMode_None;
	cmdStruct.DummyCycles 		 = n_dummy;
	cmdStruct.DataMode 			 = QSPI_PhaseMode_1bit;
	cmdStruct.DataCount 		 = n_bytes;
	
	QSPI_Command(QSPIx, QSPI_Mode_IndirectRead, &cmdStruct);
	
	for(int i = 0; i < n_bytes; i++)
	{
		while(QSPI_FIFOCount(QSPIx) < 1) __NOP();
		
		buffer[i] = QSPIx->DRB;
	}
}


/*******************************************************************************************************************************
* @brief	SPI Flash register write
* @param	QSPIx is the QSPI to use
* @param	cmd is the command used to write SPI Flash register
* @param	data is the data to be written to SPI Flash register, MSB
* @param	nbyte is the number of byte to write, can be 1, 2, 3, 4, or 0 (execute instruction without data)
* @return
*******************************************************************************************************************************/
void QSPI_WriteReg(QSPI_TypeDef * QSPIx, uint8_t cmd, uint32_t data, uint8_t n_bytes)
{
	QSPI_CmdStructure cmdStruct;
	QSPI_CmdStructClear(&cmdStruct);
	
	cmdStruct.InstructionMode 	 = QSPI_PhaseMode_1bit;
	cmdStruct.Instruction 		 = cmd;
	cmdStruct.AddressMode 		 = QSPI_PhaseMode_None;
	cmdStruct.AlternateBytesMode = QSPI_PhaseMode_None;
	cmdStruct.DummyCycles 		 = 0;
	cmdStruct.DataMode 			 = n_bytes ? QSPI_PhaseMode_1bit : QSPI_PhaseMode_None;
	cmdStruct.DataCount 		 = n_bytes;
	
	QSPI_Command(QSPIx, QSPI_Mode_IndirectWrite, &cmdStruct);
	
	for(int i = n_bytes; i > 0; i--)
		QSPIx->DRB = ((uint8_t *)&data)[i-1];
	
	while(QSPI_Busy(QSPIx)) __NOP();
}


/*******************************************************************************************************************************
* @brief	QSPI interrupt enable
* @param	QSPIx is the QSPI to set
* @param	it is interrupt type, can be QSPI_IT_ERR, QSPI_IT_DONE, QSPI_IT_FFTHR, QSPI_IT_PSMAT, QSPI_IT_TO and their '|' operation
* @return
*******************************************************************************************************************************/
void QSPI_INTEn(QSPI_TypeDef * QSPIx, uint32_t it)
{
	QSPIx->CR |=  (it << 16);
}

/*******************************************************************************************************************************
* @brief	QSPI interrupt disable
* @param	QSPIx is the QSPI to set
* @param	it is interrupt type, can be QSPI_IT_ERR, QSPI_IT_DONE, QSPI_IT_FFTHR, QSPI_IT_PSMAT, QSPI_IT_TO and their '|' operation
* @return
*******************************************************************************************************************************/
void QSPI_INTDis(QSPI_TypeDef * QSPIx, uint32_t it)
{
	QSPIx->CR &= ~(it << 16);
}

/*******************************************************************************************************************************
* @brief	QSPI interrupt flag clear
* @param	QSPIx is the QSPI to set
* @param	it is interrupt type, can be QSPI_IT_ERR, QSPI_IT_DONE, QSPI_IT_PSMAT, QSPI_IT_TO and their '|' operation
* @return
*******************************************************************************************************************************/
void QSPI_INTClr(QSPI_TypeDef * QSPIx, uint32_t it)
{
	QSPIx->FCR = it;
}

/*******************************************************************************************************************************
* @brief	QSPI interrupt state query
* @param	QSPIx is the QSPI to query
* @param	it is interrupt type, can be QSPI_IT_ERR, QSPI_IT_DONE, QSPI_IT_FFTHR, QSPI_IT_PSMAT, QSPI_IT_TO and their '|' operation
* @return	1 interrupt happened, 0 interrupt not happen
*******************************************************************************************************************************/
uint32_t QSPI_INTStat(QSPI_TypeDef * QSPIx, uint32_t it)
{
	return QSPIx->SR & it;
}
